spatterBehaviorPredictSLM_CaoLiu/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0   0   0)
    (100   0   0)
    (100   5   0)
    (0   5   0)
    
    (0   0   10)
    (100   0   10)
    (100   5   10)
    (0   5   10)
    
    (0   0   25)
    (100   0   25)
    (100   5   25)
    (0   5   25)
    
    (0   0   50)
    (100   0   50)
    (100   5   50)
    (0   5   50)
    
    (80   0   -0.3)
    (90   0   -0.3)
    (90   5   -0.3)
    (80   5   -0.3)
    
    (80   0   0)
    (90   0   0)
    (90   5   0)
    (80   5   0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 50 100) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (1000 50 75) simpleGrading (1 1 3)
    hex (8 9 10 11 12 13 14 15) (1000 50 80) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (100 50 3) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    INLET
    {
        type patch;
        faces
        (
            (10 9 5 6)
        );
    }
    
    OUTLET
    {
        type patch;
        faces
        (
            (8 11 7 4)
        );
    }

    BOTTOM
    {
        type wall;
        faces
        (
            (19 18 17 16)
        );
    }

    WALL
    {
        type wall;
        faces
        (
            (13 12 8 9)
            (14 13 9 10)
            (15 14 10 11)
            (12 15 11 8)
            (14 15 12 13)
            
            (9 8 4 5)
            (11 10 6 7)
            
            (5 4 0 1)
            (6 5 1 2)
            (7 6 2 3)
            (4 7 3 0)
            
            (21 20 16 17)
            (22 21 17 18)
            (23 22 18 19)
            (20 23 19 16)
        );
    }

    BOTTOM_cavity
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }
    
    TOP_powder
    {
        type patch;
        faces
        (
            (22 23 20 21)
        );
    }
);

mergePatchPairs
(
(BOTTOM_cavity TOP_powder)
);

// ************************************************************************* //
