spatterBehaviorPredictSLM_CaoLiu/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  9
     \/     M anipulation  |
*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.08288158151 0.0008736752629 -9.738255111e-005)
(0.08096502247 0.004905230355 -0.0001750547278)
(0.08252287363 0.001761461686 -0.0002032160509)
(0.08699258787 0.003756660767 -0.0001258034993)
(0.08201890883 0.003617843139 -6.000661814e-005)
(0.08086741148 0.004899519517 -0.0002170316474)
(0.0817279627 0.002019064627 -0.0001658401163)
(0.08776810821 0.001626267323 -0.0002291002393)
(0.08816156241 0.003417412651 -9.542584848e-005)
(0.08485361999 0.004492332812 -6.899958505e-005)
(0.08376333961 0.003428436185 -0.0001097338934)
(0.08674544171 0.001170577118 -7.297309775e-005)
(0.08506082772 0.004467474923 -0.0001747111361)
(0.0880768339 0.004381127539 -0.000161684806)
(0.08827004494 0.001383849904 -0.0001244206591)
(0.08712790865 0.004202660042 -0.0001926562086)
(0.08703065372 0.002092887256 -0.0001645187763)
(0.08080280606 0.003987848654 -0.0002305367159)
(0.08498899861 0.004427302524 -0.0001676305224)
(0.08317544893 0.00422081793 -8.034331168e-005)
(0.08211993554 0.002168512787 -0.0001411094917)
(0.08389817046 0.002311139581 -0.0002417989479)
(0.08394222865 0.001792365284 -0.0001209725537)
(0.08092321981 0.002797067524 -0.0002385024491)
(0.08854297863 0.003571763207 -0.0002684031786)
(0.0840035377 0.0003266292607 -0.0001777793036)
(0.0837919216 0.002667658873 -0.0002225131013)
(0.08093657132 0.004235484274 -5.371846536e-005)
(0.0838084052 0.003708842554 -6.886924797e-005)
(0.08468887119 0.00378970971 -9.880773768e-005)
(0.08032825123 0.004665521252 -6.683638074e-005)
(0.08077599244 0.002901240746 -9.525260707e-005)
(0.08947489285 0.004045914683 -0.0001278023166)
(0.08278484564 0.002867701874 -0.0001683661341)
(0.08865567885 0.004803052597 -0.0002311357267)
(0.08430175505 0.001247136863 -0.0001944141036)
(0.08563727934 0.001756755913 -0.0001438387778)
(0.08624313967 0.002630595295 -0.0001762144058)
(0.08496568047 0.003098680248 -0.0002406185085)
(0.08250485433 0.0030846005 -0.0002208859688)
(0.08089341236 0.00301509696 -7.747621308e-005)
(0.0867855226 0.004041787275 -0.0001785366926)
(0.08008041327 0.003557809221 -0.0002151097271)
(0.08163070927 0.003384367279 -6.666876063e-005)
(0.08736488533 0.004347462725 -5.8545723e-005)
(0.08477842503 0.004241436799 -0.0001234508093)
(0.08416719234 0.0003691092725 -0.0001573699505)
(0.08493251869 0.0005910186656 -0.0002194914852)
(0.08752136196 0.002481908135 -0.0002209595321)
(0.08856272023 0.004786301426 -0.0002235808026)
(0.08189192701 0.0001548014448 -7.062761819e-005)
(0.0811239298 0.001680067295 -0.0001733775682)
(0.08132230832 0.002960144645 -0.0002304340988)
(0.08372556178 0.003982845888 -6.047126597e-005)
(0.08552892921 0.00206880324 -0.0001758647025)
(0.08951407981 0.002511926696 -0.0002249437866)
(0.08873237403 0.00222169615 -0.0002215224433)
(0.08796097393 0.002913537352 -0.000172707519)
(0.08576484307 0.002179208055 -6.744271194e-005)
(0.08502531015 0.003120597623 -0.0001140877984)
(0.08623435923 0.003214615536 -6.100333332e-005)
(0.08740646594 0.0008255288056 -0.0001280112083)
(0.08752832292 0.002561653592 -0.0001639980595)
(0.08307893747 0.0003271686033 -7.410567786e-005)
(0.08335964869 0.002413553453 -0.0001579974665)
(0.08304262201 0.001425835918 -9.522268072e-005)
(0.08602217256 0.004805084877 -0.0001956970405)
(0.08511208529 0.003650167854 -0.0001343713099)
(0.08432211464 0.002635968717 -0.0001352046612)
(0.08058736981 0.0003440155505 -0.0001459568594)
(0.08074399495 0.002246461331 -0.000168603536)
(0.08570165707 0.004069686891 -0.0001899662262)
(0.08723643741 0.002442546251 -0.00011634286)
(0.08325051829 0.003169677402 -0.0002119778837)
(0.08870589123 0.003444484266 -0.0001704378754)
(0.08647833537 0.0009146786425 -0.0002186182238)
(0.08225530708 0.002628884747 -9.772581497e-005)
(0.08490684455 0.004911839395 -9.448128862e-005)
(0.08347690576 0.00276095644 -0.0002218264451)
(0.08321075368 0.00228721705 -0.0001256750524)
(0.08537622265 0.0002134706859 -6.369338952e-005)
(0.08771392085 0.00404090135 -0.0001634451871)
(0.08659089614 0.002255061719 -0.000132941996)
(0.0893919084 0.004760217465 -0.0001386454245)
(0.08070195553 0.002643027603 -6.69970911e-005)
(0.08472090497 0.001990186631 -0.0001617288448)
(0.08177723421 0.001443546421 -0.0001470146875)
(0.08691851598 0.002315533472 -0.000175908827)
(0.08803365185 0.002365659724 -0.0002263953363)
(0.08940822353 0.002747135727 -0.0001320215369)
(0.08740500353 0.002946737108 -0.0001709715091)
(0.08766878157 0.003805688777 -7.475508331e-005)
(0.08602212255 0.003882469906 -0.0001392018006)
(0.08906869529 0.002898988553 -0.0001006027093)
(0.0847990162 0.003305109269 -0.0001590938807)
(0.08798063886 0.002254041083 -0.0001678590372)
(0.08170728136 0.002448151406 -0.000152632354)
(0.08134013785 0.001745763298 -0.0001663077916)
(0.08389173291 0.003264343214 -0.0001314785513)
...
)
// ************************************************************************* //